app/controllers/products_controller.rb

SELECT * FROM "products" WHERE ("products"."id" = 953125641)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 953125641)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("image_url", "updated_at", "title", "price", "description", "created_at") VALUES(NULL, '2009-01-22 04:07:51', NULL, NULL, NULL, '2009-01-22 04:07:51')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 953125641)
---
  def update
    @product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 953125641)
DELETE FROM "products" WHERE "id" = 953125641
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy